In [11]:
import pandas as pd
import numpy as np
import os
os.chdir(r'C:\Javeria\Projects\Data Science Roadmap\Statistics and Math - Week 4\Youtube lecture notes')

In [88]:
#header=0 to replace the original header names as we have replaced them as well
df=pd.read_csv('income.csv', names=['name', 'income'],header=0)
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [28]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [29]:
df.income.quantile(0.75)

7750.0

In [30]:
df.income.quantile(0.25)

5500.0

In [32]:
df.income.quantile(0.25,interpolation='lower')

5000

In [33]:
df.income.quantile(0.25,interpolation='higher')

6000

In [34]:
#default interpolation
df.income.quantile(0.25,interpolation='linear')

5500.0

In [35]:
#minimum value
df.income.quantile(0)

4000.0

In [36]:
#max value. for median input 0.5
df.income.quantile(1)

10000000.0

In [39]:
#to remove outlier we decide 99 percentile
#printing outlier info
#we can define percentile_99 in advance as well
outlier_data=df[df.income>=df.income.quantile(0.99)]
outlier_data

        name    income
6  Elon Musk  10000000

In [41]:
#getting data without outliers
no_outlier_data=df[df.income<=df.income.quantile(0.99)]
no_outlier_data

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [89]:
df['income'][3]=np.NaN

C:\Users\Javeria Malik\AppData\Local\Temp\ipykernel_15644\3054271026.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3]=np.NaN

In [58]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [81]:
df_mean=df.income.mean()

In [85]:
df.loc[3,'income']=df.income.mean()
df
#can also be done this way
#df.iloc[3,1]=df.income.mean()

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [91]:
#through FILLNA way
df_new = df.fillna(df.income.mean())
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [92]:
#better if we use median
df_new = df.fillna(df.income.median())
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0